I had several iterations and I am pretty sure it is a provider issue. It always uses the default setup and ignores the num_workers. 

```  + resource "databricks_pipeline" "main" {
      + channel       = "PREVIEW"
      + configuration = {
          + "Terraform"                            = "true"
          + "pipelines.applyChangesPreviewEnabled" = "true"
        }
      + continuous    = false
      + development   = false
      + edition       = "pro"
      + id            = (known after apply)
      + name          = "***"
      + photon        = false
      + storage       = "s3://***"
      + target        = "database"
      + url           = (known after apply)

      + cluster {
          + driver_node_type_id = (known after apply)
          + label               = "default"
          + node_type_id        = "c5.xlarge"
          + num_workers         = 0

          + aws_attributes {
              + instance_profile_arn = "arn:aws:iam::***"
            }
        }

      + library {

          + notebook {
              + path = "/Repos/***"
            }
        }
    }
```